tests/Fixtures/soap/get-stock-and-price-information-by-product-id/success.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
>
  <soap:Body>
    <GetStockAndPriceInformationByProductIdResponse xmlns="Wortmann.CustomerWebService">
      <GetStockAndPriceInformationByProductIdResult>
        <Success>true</Success>
        <ProductInfoPackages>
          <ProductInfoPackage>
            <ProductId>6466320</ProductId>
            <PriceB2B>1000.00</PriceB2B>
            <PriceB2BDiscounted>1000.00</PriceB2BDiscounted>
            <PriceB2BDiscountPercent>0.00</PriceB2BDiscountPercent>
            <PriceB2BDiscountAmount>0.00</PriceB2BDiscountAmount>
            <PriceB2CinclVAT>2000.10</PriceB2CinclVAT>
            <PriceB2CexclVAT>1620.00</PriceB2CexclVAT>
            <Currency>EUR</Currency>
            <vatRate>19.00</vatRate>
            <vatCountry>DE</vatCountry>
            <Stock>100</Stock>
            <StockNextDelivery>2026-06-16T00:00:00</StockNextDelivery>
            <StockNextDeliveryAccessVolume>100</StockNextDeliveryAccessVolume>
          </ProductInfoPackage>
        </ProductInfoPackages>
      </GetStockAndPriceInformationByProductIdResult>
    </GetStockAndPriceInformationByProductIdResponse>
  </soap:Body>
</soap:Envelope>
